app/controllers/order_items_controller.rb

	def create
		@order = current_order
		@order_item = @order.order_items.new(order_item_params)
		@order.save
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
INSERT INTO "order_items" ("product_id", "order_id", "unit_price", "quantity", "total_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["product_id", 1], ["order_id", 1], ["unit_price", 1500.0], ["quantity", 1], ["total_price", 1500.0], ["created_at", "2019-01-08 00:46:40.500779"], ["updated_at", "2019-01-08 00:46:40.500779"]]
INSERT INTO "orders" ("subtotal", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["subtotal", 1500.0], ["created_at", "2019-01-08 00:46:40.498868"], ["updated_at", "2019-01-08 00:46:40.498868"]]

	def update
		@order = current_order
		@order_item = @order.order_items.find(params[:id])
		@order_item.update_attributes(order_item_params)
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1 AND "order_items"."id" = $2 LIMIT $3  [["order_id", 1], ["id", 3], ["LIMIT", 1]]
UPDATE "orders" SET "subtotal" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["subtotal", 9000.0], ["updated_at", "2019-01-08 00:46:43.757342"], ["id", 1]]
UPDATE "order_items" SET "quantity" = $1, "total_price" = $2, "updated_at" = $3 WHERE "order_items"."id" = $4  [["quantity", 5], ["total_price", 7500.0], ["updated_at", "2019-01-08 00:47:14.160038"], ["id", 3]]

	def destroy
		@order = current_order
		@order_item = @order.order_items.find(params[:id])
		@order_item.destroy
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1 AND "order_items"."id" = $2 LIMIT $3  [["order_id", 1], ["id", 24], ["LIMIT", 1]]
DELETE FROM "order_items" WHERE "order_items"."id" = $1  [["id", 24]]